In [2]:
import pandas as pd

# 1- Customer Data

In [3]:
customers = pd.read_csv("customers.csv")
customers

,CustomerID,CustomerName,Email,Gender,Age,GeographyID
0,1,Emma Anderson,emma.anderson@example.com,Male,50,2
1,2,Sarah Brown,sarah.brown@example.com,Female,37,4
2,3,Robert Hernandez,robert.hernandez@example.com,Female,26,6
3,4,David Garcia,david.garcia@example.com,Male,25,8
4,5,Emma Miller,emma.miller@example.com,Female,41,4
...,...,...,...,...,...,...
95,96,Emily Gonzalez,emily.gonzalez@example.com,Female,38,10
96,97,Emily Rodriguez,emily.rodriguez@example.com,Female,51,3
97,98,Chris Lopez,chris.lopez@example.com,Female,55,10
98,99,Laura Hernandez,laura.hernandez@example.com,Male,41,5
99,100,Jane Brown,jane.brown@example.com,Female,45,10

In [4]:
customers.shape

(100, 6)

In [5]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    100 non-null    int64
 1   CustomerName  100 non-null    object
 2   Email         100 non-null    object
 3   Gender        100 non-null    object
 4   Age           100 non-null    int64
 5   GeographyID   100 non-null    int64
dtypes: int64(3), object(3)
memory usage: 4.8+ KB

In [6]:
customers.duplicated().sum()

0

In [7]:
customers.isna().sum()

CustomerID      0
CustomerName    0
Email           0
Gender          0
Age             0
GeographyID     0
dtype: int64

In [8]:
customers.Gender.value_counts()

Gender
Female    54
Male      46
Name: count, dtype: int64

In [9]:
customers.Age.min(), customers.Age.max(), customers.Age.mean()

(18, 69, 41.99)

# 2- Products Data

In [10]:
products = pd.read_excel("products.xlsx")
products

    ProductID      ProductName Category   Price
0           1    Running Shoes   Sports  223.75
1           2  Fitness Tracker   Sports  196.68
2           3         Yoga Mat   Sports  485.32
3           4        Dumbbells   Sports   26.21
4           5      Soccer Ball   Sports   41.26
5           6    Tennis Racket   Sports   36.07
6           7       Basketball   Sports  225.12
7           8  Football Helmet   Sports   44.75
8           9   Baseball Glove   Sports  327.36
9          10       Golf Clubs   Sports   81.59
10         11        Ski Boots   Sports  340.20
11         12       Ice Skates   Sports   37.56
12         13     Swim Goggles   Sports  145.97
13         14   Cycling Helmet   Sports  472.32
14         15    Climbing Rope   Sports  410.17
15         16            Kayak   Sports  259.40
16         17        Surfboard   Sports  275.43
17         18       Volleyball   Sports   42.80
18         19     Hockey Stick   Sports  173.83
19         20    Boxing Gloves   Sports  262.32

In [11]:
products.ProductName.unique()

array(['Running Shoes', 'Fitness Tracker', 'Yoga Mat', 'Dumbbells',
       'Soccer Ball', 'Tennis Racket', 'Basketball', 'Football Helmet',
       'Baseball Glove', 'Golf Clubs', 'Ski Boots', 'Ice Skates',
       'Swim Goggles', 'Cycling Helmet', 'Climbing Rope', 'Kayak',
       'Surfboard', 'Volleyball', 'Hockey Stick', 'Boxing Gloves'],
      dtype=object)

In [12]:
products.Category.unique()

array(['Sports'], dtype=object)

In [13]:
products.duplicated().sum()

0

In [14]:
products.isna().sum()

ProductID      0
ProductName    0
Category       0
Price          0
dtype: int64

In [15]:
products.shape

(20, 4)

# 3- Customers' Geography Data

In [16]:
geography = pd.read_csv("geography.csv")
geography

    1           UK     London
0   2      Germany     Berlin
1   3       France      Paris
2   4        Spain     Madrid
3   5        Italy       Rome
4   6  Netherlands  Amsterdam
5   7      Belgium   Brussels
6   8       Sweden  Stockholm
7   9  Switzerland     Zurich
8  10      Austria     Vienna

# 4- Customers' Review Data

In [17]:
reviews  = pd.read_csv("customer_reviews.csv")
reviews

,ReviewID,CustomerID,ProductID,ReviewDate,Rating,ReviewText
0,1,77,18,12/23/2023,3,"Average experience, nothing special."
1,2,80,19,12/25/2024,5,The quality is top-notch.
2,3,50,13,1/26/2025,4,Five stars for the quick delivery.
3,4,78,15,4/21/2025,3,"Good quality, but could be cheaper."
4,5,64,2,7/16/2023,3,"Average experience, nothing special."
...,...,...,...,...,...,...
1358,1359,28,4,5/25/2023,3,Not worth the money.
1359,1360,58,12,11/13/2023,2,"Average experience, nothing special."
1360,1361,96,15,3/7/2023,5,Customer support was very helpful.
1361,1362,99,2,12/3/2025,1,Product did not meet my expectations.
1362,1363,16,4,7/16/2024,2,The product arrived late.

In [18]:
reviews.duplicated().sum()

0

In [19]:
reviews.isna().sum()

ReviewID      0
CustomerID    0
ProductID     0
ReviewDate    0
Rating        0
ReviewText    0
dtype: int64

# 5- Customers' Engagement Data

In [20]:
engagement = pd.read_csv("engagement_data.csv")
engagement

,EngagementID,ContentID,ContentType,Likes,EngagementDate,CompaignID,ProductID,ViewsClickCombined
0,1,39,Blog,190,8/30/2023,1,9,1883-671
1,2,48,Blog,114,3/28/2023,18,20,5280-532
2,3,16,video,32,12/8/2023,7,14,1905-204
3,4,43,Video,17,1/21/2025,19,20,2766-257
4,5,16,newsletter,306,2/21/2024,6,15,5116-1524
...,...,...,...,...,...,...,...,...
4618,4619,31,Video,270,5/21/2023,3,19,8115-1872
4619,4620,46,newsletter,209,7/17/2023,8,4,1273-516
4620,4621,10,video,78,5/24/2023,20,7,1609-599
4621,4622,6,socialmedia,50,4/14/2024,18,2,3052-374
4622,4623,31,BLOG,133,9/1/2023,2,17,2458-457

In [21]:
engagement.duplicated().sum()

0

In [22]:
engagement.isna().sum()

EngagementID          0
ContentID             0
ContentType           0
Likes                 0
EngagementDate        0
CompaignID            0
ProductID             0
ViewsClickCombined    0
dtype: int64

# Customers' Journey

In [36]:
# Load the dataset
customer_journey_df = pd.read_excel('customer_journey.xlsx')
customer_journey_df.shape

(4011, 7)

In [37]:
customer_journey_df.duplicated().sum()

71

In [38]:
customer_journey_df[customer_journey_df.duplicated()].sort_values(by="JourneyID")

,JourneyID,CustomerID,ProductId,VisitDate,Stage,Actiob,Duration
3993,23,58,1,2023-07-05,Homepage,View,48.0
3939,203,44,11,2024-12-28,Homepage,View,230.0
3940,404,30,13,2023-04-22,Homepage,View,112.0
3979,443,98,5,2023-09-04,Checkout,Drop-off,NaN
3995,494,29,6,2024-10-27,Checkout,Drop-off,NaN
...,...,...,...,...,...,...,...
3967,3781,54,8,2025-04-14,Homepage,View,250.0
3983,3852,99,5,2025-09-07,ProductPage,View,205.0
3941,3881,58,18,2024-08-27,Checkout,Drop-off,NaN
3938,3912,99,9,2025-06-13,Homepage,Click,143.0
3957,3930,2,9,2024-09-22,Homepage,Click,260.0

In [39]:
customer_journey_df.drop_duplicates(keep='first', inplace=True)

In [40]:
customer_journey_df.isna().sum()

JourneyID       0
CustomerID      0
ProductId       0
VisitDate       0
Stage           0
Actiob          0
Duration      599
dtype: int64

In [41]:
# Rename columns 
customer_journey_df.columns = [
    "JourneyID", "CustomerID", "ProductID", "VisitDate", 
    "Stage", "Action", "Duration"
]

In [42]:
# Convert VisitDate to datetime and Duration to numeric
customer_journey_df['VisitDate'] = pd.to_datetime(customer_journey_df['VisitDate'], errors='coerce')
customer_journey_df['Duration'] = pd.to_numeric(customer_journey_df['Duration'], errors='coerce')

In [43]:
customer_journey_df

,JourneyID,CustomerID,ProductID,VisitDate,Stage,Action,Duration
0,1,64,18,2024-06-10,Checkout,Drop-off,NaN
1,2,94,11,2025-07-09,Checkout,Drop-off,NaN
2,3,34,8,2024-06-14,ProductPage,View,235.0
3,4,33,18,2025-05-28,Checkout,Drop-off,NaN
4,5,91,10,2023-02-11,Homepage,Click,156.0
...,...,...,...,...,...,...,...
3984,2655,84,4,2023-10-09,Homepage,View,146.0
3991,2653,86,2,2023-06-08,productpage,Click,247.0
3997,97,92,19,2025-05-26,Homepage,View,203.0
4005,3531,70,5,2025-08-04,checkout,Drop-off,NaN
4007,1248,17,8,2023-12-13,homepage,Click,153.0

In [44]:
# it calculates the average duration and fill against each group occurance
customer_journey_df.groupby('VisitDate')['Duration'].transform('mean')

0       132.333333
1       169.250000
2       184.250000
3        12.000000
4       104.600000
           ...
3984    147.000000
3991    214.000000
3997    162.000000
4005    203.000000
4007    141.250000
Name: Duration, Length: 3940, dtype: float64

In [3]:
import numpy as np
df = pd.DataFrame({'Animal': ['Parrot','Falcon', 'Falcon',
                              'Parrot', 'Parrot', 'Falcon','Parrot'],
                   'Max Speed': [380., 370.,np.nan, 24., 26.,np.nan,np.nan]})
df

   Animal  Max Speed
0  Parrot      380.0
1  Falcon      370.0
2  Falcon        NaN
3  Parrot       24.0
4  Parrot       26.0
5  Falcon        NaN
6  Parrot        NaN

In [4]:
df.groupby(['Animal']).mean()

         Max Speed
Animal
Falcon  370.000000
Parrot  143.333333

In [5]:
df['avg_spd']=df.groupby(['Animal']).transform('mean')
df

   Animal  Max Speed     avg_spd
0  Parrot      380.0  143.333333
1  Falcon      370.0  370.000000
2  Falcon        NaN  370.000000
3  Parrot       24.0  143.333333
4  Parrot       26.0  143.333333
5  Falcon        NaN  370.000000
6  Parrot        NaN  143.333333

In [6]:
df['Max Speed'].fillna(df['avg_spd'])

0    380.000000
1    370.000000
2    370.000000
3     24.000000
4     26.000000
5    370.000000
6    143.333333
Name: Max Speed, dtype: float64

In [45]:
# Step 4: Replace missing Duration values with the average for each VisitDate
customer_journey_df['avg_duration'] = customer_journey_df.groupby('VisitDate')['Duration'].transform('mean')
customer_journey_df['Duration'] = customer_journey_df['Duration'].fillna(customer_journey_df['avg_duration'])

In [47]:
# Step 5: Convert Stage to uppercase for consistency
customer_journey_df['Stage'] = customer_journey_df['Stage'].str.upper()

In [48]:
customer_journey_df

,JourneyID,CustomerID,ProductID,VisitDate,Stage,Action,Duration,avg_duration
0,1,64,18,2024-06-10,CHECKOUT,Drop-off,132.333333,132.333333
1,2,94,11,2025-07-09,CHECKOUT,Drop-off,169.250000,169.250000
2,3,34,8,2024-06-14,PRODUCTPAGE,View,235.000000,184.250000
3,4,33,18,2025-05-28,CHECKOUT,Drop-off,12.000000,12.000000
4,5,91,10,2023-02-11,HOMEPAGE,Click,156.000000,104.600000
...,...,...,...,...,...,...,...,...
3984,2655,84,4,2023-10-09,HOMEPAGE,View,146.000000,147.000000
3991,2653,86,2,2023-06-08,PRODUCTPAGE,Click,247.000000,214.000000
3997,97,92,19,2025-05-26,HOMEPAGE,View,203.000000,162.000000
4005,3531,70,5,2025-08-04,CHECKOUT,Drop-off,203.000000,203.000000
4007,1248,17,8,2023-12-13,HOMEPAGE,Click,153.000000,141.250000

In [51]:
# Drop intermediate columns
customer_journey_df = customer_journey_df.drop(columns=['avg_duration'],axis=1)

In [52]:
# Save or display the cleaned dataset
customer_journey_df.to_csv('cleaned_customer_journey.csv', index=False)

In [53]:
customer_journey_df

,JourneyID,CustomerID,ProductID,VisitDate,Stage,Action,Duration
0,1,64,18,2024-06-10,CHECKOUT,Drop-off,132.333333
1,2,94,11,2025-07-09,CHECKOUT,Drop-off,169.250000
2,3,34,8,2024-06-14,PRODUCTPAGE,View,235.000000
3,4,33,18,2025-05-28,CHECKOUT,Drop-off,12.000000
4,5,91,10,2023-02-11,HOMEPAGE,Click,156.000000
...,...,...,...,...,...,...,...
3984,2655,84,4,2023-10-09,HOMEPAGE,View,146.000000
3991,2653,86,2,2023-06-08,PRODUCTPAGE,Click,247.000000
3997,97,92,19,2025-05-26,HOMEPAGE,View,203.000000
4005,3531,70,5,2025-08-04,CHECKOUT,Drop-off,203.000000
4007,1248,17,8,2023-12-13,HOMEPAGE,Click,153.000000

In [5]:
a = 100

In [7]:
a = a + 200
a

300

In [16]:
a = a+1

In [17]:
a

305

In [44]:
a //=2
a

18.0

In [45]:
12/6

2.0

In [46]:
12//6

2

In [48]:
12.0//5

2.0